{"id":"158dd1d9-c691-400b-b098-1a27a1496474","updated_at":"2026-07-16T06:28:27.555Z","updated_by":"elastic","created_at":"2026-07-16T06:28:27.555Z","created_by":"elastic","name":"Account Takeover (ATO) Following Brute-Force","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Brute-forcing login page with automated dictionary attack.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"d430acd1-ee0b-4fc2-828a-52a7da5d6aea","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"sequence by source.ip with maxspan=5m\n  [web where url.query : \"*login=failed*\" ] with runs=10\n  [web where url.query : \"*login=success*\"]","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
